app/controllers/products_controller.rb

  def index
    products = Product.all
    if category_id = params[:category_id]
      products = products.where(category_id: category_id)
---
SELECT "products".* FROM "products"
SELECT "products".* FROM "products"  WHERE "products"."category_id" = 1

  def create
    product = Product.new(product_params)

    if product.save
---
INSERT INTO "products" ("category_id", "color", "created_at", "description", "faces", "name", "price", "rarity", "shine", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    product = Product.find(params[:id])

    if product.update_attributes(product_params)
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "products" SET "name" = ?, "updated_at" = ? WHERE "products"."id" = 2  [["name", "Gold"], ["updated_at", "2014-11-17 21:59:48.694018"]]

  def destroy
    product = Product.find(params[:id])
    product.destroy!
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 1]]